#+TITLE: Emacs Configuration
#+OPTIONS: toc:4 h:4
#+STARTUP: showeverything
#+LATEX_CLASS: jmeorgdoc

*** Packages

This list is a /mostly/ up-to-date list of the packages I use. Refer to the
=Cask= file for the list of packages actually installed.

My friend [[https://github.com/gordyt][Gordon]] put together the following script to generate a list of
the packages installed, which means the list is more up-to-date than it
used to be.

#+BEGIN_SRC emacs-lisp :tangle no
  (defun jme/gen-package-table ()
    "Generate a table of all installed packages, along with their descriptions"
    (cons '("_Package Name_" "_Package Description_")
    (sort
     (mapcar
      (lambda (pkg-desc)
        (list (car pkg-desc) (package-desc-summary (cadr pkg-desc))))
      package-alist)
     `(lambda (a b) (string-lessp (car a) (car b))))))

  (jme/gen-package-table)
#+END_SRC

#+RESULTS:
| _Package Name_                  | _Package Description_                                                              |
| ace-jump-mode                   | a quick cursor location minor mode for emacs                                       |
| ace-window                      | Quickly switch windows.                                                            |
| alert                           | Growl-style notification system for Emacs                                          |
| annoying-arrows-mode            | Ring the bell if using arrows too much                                             |
| async                           | Asynchronous processing in Emacs                                                   |
| auctex                          | Integrated environment for *TeX*                                                   |
| auto-compile                    | automatically compile Emacs Lisp libraries                                         |
| auto-complete                   | Auto Completion for GNU Emacs                                                      |
| bbdb                            | The Insidious Big Brother Database for GNU Emacs                                   |
| bind-key                        | A simple way to manage personal keybindings                                        |
| cask                            | Cask: Project management for Emacs package development                             |
| cider                           | Clojure Integrated Development Environment and REPL                                |
| clojure-cheatsheet              | The Clojure Cheatsheet for Emacs                                                   |
| clojure-mode                    | Major mode for Clojure code                                                        |
| clojure-mode-extra-font-locking | Extra font-locking for Clojure mode                                                |
| clojure-snippets                | Yasnippets for clojure                                                             |
| cm-mode                         | Minor mode for CriticMarkup                                                        |
| cmake-mode                      | major-mode for editing CMake sources                                               |
| coffee-mode                     | Major mode to edit CoffeeScript files in Emacs                                     |
| color-theme-sanityinc-tomorrow  | A version of Chris Kempson's various Tomorrow themes                               |
| company                         | Modular text completion framework                                                  |
| concurrent                      | Concurrent utility functions for emacs lisp                                        |
| creole                          | A parser for the Creole Wiki language                                              |
| ctable                          | Table component for Emacs Lisp                                                     |
| dash                            | A modern list library for Emacs                                                    |
| db                              | A database for EmacsLisp                                                           |
| deferred                        | Simple asynchronous functions for emacs lisp                                       |
| deft                            | quickly browse, filter, and edit plain text notes                                  |
| diminish                        | Diminished modes are minor modes with no modeline display                          |
| dired+                          | Extensions to Dired.                                                               |
| direx                           | Simple Directory Explorer                                                          |
| edit-server                     | server that responds to edit requests from Chrome                                  |
| elnode                          | The Emacs webserver.                                                               |
| epc                             | A RPC stack for the Emacs Lisp                                                     |
| epl                             | Emacs Package Library                                                              |
| expand-region                   | Increase selected region by semantic units.                                        |
| f                               | Modern API for working with files and directories                                  |
| faceup                          | Regression test system for font-lock                                               |
| fakir                           | fakeing bits of Emacs                                                              |
| flx                             | fuzzy matching with good sorting                                                   |
| flx-ido                         | flx integration for ido                                                            |
| flycheck                        | Modern on-the-fly syntax checking for GNU Emacs                                    |
| flycheck-clojure                | Flycheck: Clojure support                                                          |
| flycheck-haskell                | Flycheck: Cabal projects and sandboxes                                             |
| flycheck-pos-tip                | Flycheck errors display in tooltip                                                 |
| fringe-helper                   | helper functions for fringe bitmaps                                                |
| ghci-completion                 | Completion for GHCi commands in inferior-haskell buffers                           |
| git-commit-mode                 | Major mode for editing git commit messages                                         |
| git-gutter                      | Port of Sublime Text plugin GitGutter                                              |
| git-gutter-fringe               | Fringe version of git-gutter.el                                                    |
| git-messenger                   | Pop up last commit information of current line                                     |
| git-rebase-mode                 | Major mode for editing git rebase files                                            |
| git-timemachine                 | Walk through git revisions of a file                                               |
| gntp                            | Growl Notification Protocol for Emacs                                              |
| gnuplot                         | drive gnuplot from within emacs                                                    |
| gnuplot-mode                    | Major mode for editing gnuplot scripts                                             |
| graphviz-dot-mode               | Mode for the dot-language used by graphviz (att).                                  |
| guide-key                       | Guide the following key bindings automatically and dynamically                     |
| handlebars-mode                 | A major mode for editing Handlebars files.                                         |
| haskell-mode                    | A Haskell editing mode                                                             |
| helm                            | Helm is an Emacs incremental and narrowing framework                               |
| helm-descbinds                  | Yet Another `describe-bindings' with `helm'.                                       |
| helm-git-files                  | helm for git files                                                                 |
| helm-projectile                 | Helm integration for Projectile                                                    |
| helm-swoop                      | Efficiently hopping squeezed lines powered by helm interface                       |
| hi2                             | indentation module for Haskell Mode                                                |
| highlight-indentation           | Minor modes for highlighting indentation                                           |
| htmlize                         | Convert buffer text and decorations to HTML.                                       |
| hydra                           | Make bindings that stick around                                                    |
| ido-ubiquitous                  | Use ido (nearly) everywhere.                                                       |
| ido-vertical-mode               | Makes ido-mode display vertically.                                                 |
| jabber                          | A Jabber client for Emacs.                                                         |
| jedi                            | a Python auto-completion for Emacs                                                 |
| jedi-core                       | Common code of jedi.el and company-jedi.el                                         |
| js2-mode                        | Improved JavaScript editing mode                                                   |
| kv                              | key/value data structure functions                                                 |
| let-alist                       | Easily let-bind values of an assoc-list by their names                             |
| log4e                           | provide logging framework for elisp                                                |
| magit                           | control Git from Emacs                                                             |
| markdown-mode                   | Emacs Major mode for Markdown-formatted text files                                 |
| markdown-mode+                  | extra functions for markdown-mode                                                  |
| multi-term                      | Managing multiple terminal buffers in Emacs.                                       |
| noflet                          | locally override functions                                                         |
| nose                            | Easy Python test running in Emacs                                                  |
| org                             | Outline-based notes management and organizer                                       |
| org-bullets                     | Show bullets in org-mode as UTF-8 characters                                       |
| org-mac-iCal                    | Imports events from iCal.app to the Emacs diary                                    |
| ox-reveal                       | reveal.js Presentation Back-End for Org Export Engine                              |
| package-build                   | Tools for assembling a package archive                                             |
| packed                          | package manager agnostic Emacs Lisp package utilities                              |
| pallet                          | A package management tool for Emacs, using Cask.                                   |
| paradox                         | A modern Packages Menu. Colored, with package ratings, and customizable.           |
| pkg-info                        | Information about packages                                                         |
| plantuml-mode                   | Major mode for plantuml                                                            |
| popup                           | Visual Popup User Interface                                                        |
| popwin                          | Popup Window Manager.                                                              |
| pretty-mode                     | Redisplay parts of the buffer as pretty symbols.                                   |
| projectile                      | Manage and navigate projects in Emacs easily                                       |
| pydoc-info                      | Better Python support for info-lookup-symbol.                                      |
| python-environment              | virtualenv API for Emacs Lisp                                                      |
| queue                           | Queue data structure                                                               |
| racket-mode                     | Major mode for Racket language.                                                    |
| rainbow-delimiters              | Highlight brackets according to their depth                                        |
| rainbow-mode                    | Colorize color names in buffers                                                    |
| request                         | Compatible layer for URL request in Emacs                                          |
| request-deferred                | Wrap request.el by deferred                                                        |
| restclient                      | An interactive HTTP client for Emacs                                               |
| s                               | The long lost Emacs string manipulation library.                                   |
| scala-mode2                     | Major mode for editing Scala >= 2.9                                                |
| shut-up                         | Shut up would you!                                                                 |
| slamhound                       | Rip Clojure namespaces apart and rebuild them.                                     |
| slime                           | Superior Lisp Interaction Mode for Emacs                                           |
| smartparens                     | Automatic insertion, wrapping and paredit-like navigation with user defined pairs. |
| smex                            | M-x interface with Ido-style fuzzy matching.                                       |
| spinner                         | Add spinners and progress-bars to the mode-line for ongoing operations             |
| stylus-mode                     | Major mode for editing .jade files                                                 |
| sws-mode                        | (S)ignificant (W)hite(S)pace mode                                                  |
| test-simple                     | Simple Unit Test Framework for Emacs Lisp                                          |
| undo-tree                       | Treat undo history as a tree                                                       |
| use-package                     | A use-package declaration for simplifying your .emacs                              |
| web                             | useful HTTP client                                                                 |
| window-layout                   | window layout manager                                                              |
| xml-rpc                         | An elisp implementation of clientside XML-RPC                                      |
| yasnippet                       | Yet another snippet extension for Emacs.                                           |

